# actionPerformed

Публичный метод, являющийся основным узлом плагина, так как именно он вызывает остальные методы в зависимости от обрабатываемого события.

## Входные данные
Принимает на вход объект `AnActionEvent` (имя объекта: event), в котором содержится информация о текущем контексте действия.
Если говорить конкретнее, то мы получаем информацию о выделенном тексте (вне зависимости от того, выделен ли он вообще), а также о нажатом сочетании клавиш.

## Реализация
Изначально обрабатывается объект event его обработка завершается досрочно в следующих случаях, являющихся исключениями.
1. В текущем контексте нет активного редактора.
2. Не удалось получить файл для текущего Editor. Ошибка в получении файла, если editor или его Document некорректны, или если файл временно недоступен.
3. Расширения файла отсутствует или его невозможно определить.
4. Текст не выделен
Как только event обработан, из него извлечена основная информация, скопированный в переменную `selectedText` текст изменяется.
Далее, в зависимости от сочетания клавиш текст либо копируется, либо вырезается, либо отправляется в телеграмм.

> [!IMPORTANT]
> В силу размера http запросов, а также возможностей телеграмма можно пересылать сообщения не более 1150 символов


## Результат работы
Результатом работы являются соответствующие нажатому сочетанию клавиш действия с выделенным текстом.<br>
В случае нажатия сочетания `ctrl + shift + c` выделенный текст с небольшими изменениями копируется в буфер обмена.<br>
В случае нажатия сочетания `ctrl + shift + x` выделенный текст вырезается из файла и с небольшими изменениями копируется в буфер обмена.<br>
В случае нажатия сочетания `ctrl + shift + p` создаётся http запрос на пересылку выделенного текста в телеграмм, у пользователя открывается браузер, который обрабатывает запрос и открывает приложение телеграмм, выводя меню выбора получателя.<br>
## Примеры вызова
### ctrl + shift + c
1. Выделенный текст:<br>
```
int main() {
int2023_t value_1 = from_string("-1234657890986543234567898765234543234567898765");
int2023_t value_2 = from_int(312);
std::cout << value_1[5]; //2

    return 0;
}
```
Расширение файла - cpp<br>
Скопированный текст:<br>

\`\`\`cpp<br>
int main() {<br>
    int2023_t value_1 = from_string("-1234657890986543234567898765234543234567898765");<br>
    int2023_t value_2 = from_int(312);<br>
    std::cout << value_1[5]; //2<br>
<br>
    return 0;<br>
}<br>
\`\`\`<br>
<br>
2. Выделенный текст:<br>
```
int main() {
int2023_t value_1 = from_string("-1234657890986543234567898765234543234567898765");
int2023_t value_2 = from_int(312);
std::cout << value_1[5]; //2

    return 0;
}
```
Расширение файла - расширения нет<br>
Скопированный текст:<br>Текст не копируется

### ctrl + shift + x
1. Выделенный текст:<br>
```
int main() {
int2023_t value_1 = from_string("-1234657890986543234567898765234543234567898765");
int2023_t value_2 = from_int(312);
std::cout << value_1[5]; //2

    return 0;
}
```
Расширение файла - cpp<br>
Скопированный текст:<br>

\`\`\`cpp<br>
int main() {<br>
int2023_t value_1 = from_string("-1234657890986543234567898765234543234567898765");<br>
int2023_t value_2 = from_int(312);<br>
std::cout << value_1[5]; //2<br>
<br>
return 0;<br>
}<br>
\`\`\`<br>
Выделенный текст:
```cpp

```
2. Выделенный текст:<br>
```
int main() {
int2023_t value_1 = from_string("-1234657890986543234567898765234543234567898765");
int2023_t value_2 = from_int(312);
std::cout << value_1[5]; //2

    return 0;
}
```
Расширение файла - расширения нет<br>
Скопированный текст: текст не копируется<br>
Текст не удаляется<br>
### ctrl + shift + p
1. Выделенный текст:<br>
```
int main() {
int2023_t value_1 = from_string("-1234657890986543234567898765234543234567898765");
int2023_t value_2 = from_int(312);
std::cout << value_1[5]; //2

    return 0;
}
```
Расширение файла - cpp<br>
Пересланный текст:<br>

\`\`\`cpp<br>
int main() {<br>
int2023_t value_1 = from_string("-1234657890986543234567898765234543234567898765");<br>
int2023_t value_2 = from_int(312);<br>
std::cout << value_1[5]; //2<br>
<br>
return 0;<br>
}<br>
\`\`\`<br>
2. Выделенный текст:<br>
```
int main() {
int2023_t value_1 = from_string("-1234657890986543234567898765234543234567898765");
int2023_t value_2 = from_int(312);
std::cout << value_1[5]; //2

    return 0;
}
```
Расширение файла - расширения нет<br>
Пересланный текст: текст не пересылается<br>